{"pages":[{"text":"Λήψεις Επισκεφθείτε την σελίδα με τα περιεχόμενα του έργου στο Github Σύντομα θα είναι διαθέσιμη η πρώτη έκδοση του λειτουργικού για λήψη και εγκατάσταση στο Pi Board σας","tags":"pages","loc":"http://businesspi.github.io/pages/downloads.html","title":"Downloads"},{"text":"Τεκμηρίωση Η ανάπτυξη του έργου συνοδεύεται και απο εκτενή τεκμηρίωση με άρθρα, οδηγούς χρήσης και τεχνικές προδιαγραφές τα οποία μπορείτε να διαβάσετε στο Wiki του BusinessPi στην διεύθηνση : https://github.com/ellak-monades-aristeias/BusinessPi/wiki Αναφορά προβλήματος Για αναφορά προβλήματος σχετικό με οποιοδήποτε τμήμα του έργου BusinessPi (Λειτουργικό σύστημα, Λογισμικά, Ιστοσελίδα, Wiki) παρακαλώ επισκεφθείτε την σελίδα: https://github.com/ellak-monades-aristeias/BusinessPi/issues κάντε κλίκ στο New Issue και συμπληρώστε το αίτημά σας όπως φαίνεται στην εικόνα παρακάτω απαντώντας κάποιες βασικές ερωτήσεις και δίνοντας αναλυτικές πληροφορίες για να μπορεί να αναπαραχθεί το πρόβλημα που αντιμετωπίζετε ώστε να γίνει προσπάθεια επίλυσής του. Επικοινωνία - Συζήτηση Για συζήτηση, η για να θέσετε ένα ερώτημα παρακαλώ επισκεφθείτε την σελίδα: https://github.com/ellak-monades-aristeias/BusinessPi/issues κάντε κλίκ στο New Issue και γράψτε το αίτημα η την ερώτησή σας.","tags":"pages","loc":"http://businesspi.github.io/pages/feedback.html","title":"Feedback"},{"text":"Στα προϊγούμενο άρθρο κάναμε μια εισαγωγή στο τι είναι το BusinessPi και είδαμε τεχνικές λεπτομέριες σχετικά με το Hardware του. Μπορείτε να τα διαβάσετε στις παρακάτω αναρτήσεις: Τι είναι το BusinessPi Hardware δοκιμών Λειτουργικό Σύστημα Για τις ανάγκες του λειτουργικού συστήματος του έργου BusinessPi, μετά την επιλογή που έγινε σχετικά με το Hardware (βλέπε Hardware ) επιλέχτηκε να χρησιμοποιηθεί ως βάση το Bananian . Το Bananian είναι ένα ΕΛ/ΛΑΚ λειτουργικό σύστημα το οποίο είναι μια ελαφρώς τροποποιημένη και βελτιστοποιημένη για το Banana Pi εκδοχή του Debian. Χρησιμοποιεί τα επίσημα αποθετήρια του Debian για αρχιτεκτονικές armhf και πυρήνα Linux μαζί με bootmanager u-boot μεταγλωττισμένο για το Banana Pi. Ως αποτέλεσμα των παραπάνω το λειτουργικό του BusinessPi εκμεταλλεύεται την βελτιστοποίηση που έχει υποστεί το Bananian για την συμβατότητά του με το Banana Pi Board με την αξιοπιστία, διαθεσιμότητα λογισμικού και υποστήριξης που έχει απο την κοινότητά του το Debian GNU/Linux Λογισμικό Το λειτουργικό σύστημα του έργου BusinessPi αποτελείται απο: Bananian Linux Υπηρεσίες Λογισμικό Bananian Linux Το Bananian Linux παρέχει προεγκατεστημένα τα εξής: Μινιμαλιστικό Debian 7 (Wheezy) armhf Επίσημα αποθετήρια του Debian Linux kernel: 3.4.x (sunxi-linux) Σύστημα init: SysVinit zsh (κέλυφος με ρυθμίσεις απο το http://grml.org/zsh/, το κέλυφος bash είναι επίσης διαθέσιμο) Υπηρεσίες Το λειτουργικό σύστημα είναι προρυθμισμένο να παρέχει στους χρήστες του δικτύου τις εξής υπηρεσίες SSH server apache server mysql server lm-sensors (θερμοκρασίες) NTP server haveged (entropy daemon) rsyslogd (syslog daemon) Λογισμικό Το λειτουργικό σύστημα παρέχει προεγκατεστημένα τα εξής λογισμικά VTiger CRM (Διαχείριση Πελατολογίου και Προϊόντων/Υπηρεσιών) htop (παρακολούθηση του συστήματος) bwm-ng (παρακολούθηση bandwith) screen (terminal multiplexer) bananian-config: ορισμός timezone, locales, hostname, root password, video acceleration, hardware platform, OTG port και επέκταση συστήματος αρχείων (για να ρυθμίσετε το σύστημα αρχείων να καταλαμβάνει όλη την κάρτα SD) bananian-update: αναβάθμιση του Bananian σε νέα έκδοση του λειτουργικού. Επειδή το έργο απαιτούσε (για λόγους δοκιμών) πολλαπλές και επαναλαμβανόμενες εγκαταστάσεις του Vtiger CRM και Apache/MySQL στο BananaPi, ως μέρος του έργου αναπτύχθηκε λογισμικό που αυτοματοποιεί την λήψη, ρύθμιση των υπηρεσιών και εγκατάσταση του Vtiger στο λειτουργικό σύστημα. Το λογισμικό αυτό, ο αναγνώστης μπορεί να το χρησιμοποιήσει σε οποιοδήποτε σύστημα βασισμένο σε Debian/Ubuntu ανεξάρτητα αν το λειτουργικό σύστημα είναι εγκατεστημένο σε Board, PC, Server ή Εικονική μηχανή. Θα παρουσιάσουμε το λογισμικό σε ένα απο τα επόμενα άρθρα. VtigerCRM Το Vtiger είναι ένα ελεύθερο και ανοιχτού κώδικα ( βλέπε Vtiger Open Source ) εταιρικό λογισμικό που εντάσσεται στην κατηγορία λογισμικών \"Διαχείρισης Πελατειακών Σχέσεων\" CRM και είναι ήδη προεγκατεστημένο στο BusinessPi. Η Διαχείριση Πελατειακών Σχέσεων (CRM) είναι μία ευρέως εφαρμοσμένη στρατηγική για την διαχείριση των αλληλεπιδράσεων μιας επιχείρησης με πελάτες, συμβολαιούχους πελάτες και προοπτικές πωλήσεων. Το Vtiger χρησιμοποιείται για να οργανώσει, αυτοματοποιήσει και να συγχρονίσει διεργασίες – κυρίως δραστηριότητες πωλήσεων, αλλά και αυτές που αφορούν το μάρκετινγκ, την εξυπηρέτηση πελατών και την τεχνική υποστήριξη μιας επιχείρησης. Οι γενικοί στόχοι του Vtiger είναι να βοηθήσει σε όλες τις εργασίες που έχουν να κάνουν με την εύρεση, προσέλκυση και απόκτηση νέων συμβολαιούχους πελάτες, να διατηρήσει αυτούς που η επιχείρηση ήδη έχει, να δελεάσει πρώην πελάτες να έρθουν πίσω, και να μειώσει το κόστος του μάρκετινγκ και της εξυπηρέτησης πελατών. Οι δυνατότητες που παρέχει απευθύνονται σε όλες τις επιχειρήσεις που κάνουν πώληση προϊόντων ή υπηρεσιών αλλά και εταιρίες συμβούλων, δικηγόρων, ιατρών, λογιστών, ασφαλιστών και άλλων. Συνοπτικά περιλαμβάνει: Ημερολόγιο Διαχείριση Email Πελατολόγιο / Ιστορικό συναλλαγών Διαχείριση Προωθητικών ενεργειών Τιμολόγηση Διαχείριση Έργων Αναφορές / Στατιστικά δεδομένα Σας συστήνουμε ανεπιφύλακτα να μελετήσετε τον επίσημο οδηγό χρήσης του Vtiger https://wiki.vtiger.com/vtiger6/index.php/Main_Page . Να σημειώσουμε ότι στον οδηγό πολλές φορές μπορεί να αναφέρονται για το Online Vtiger ή ως On-demand Vtiger, το οποίο είναι η online έκδοση που προσφέρεται ως ενοικιαζόμενη υπηρεσία από την εταιρία Vtiger. Τέλος να αναφέρουμε ότι έχουμε εξελληνισμένο το Vtiger 6 και μπορείτε να προσθέσετε το πακέτο ελληνικής γλώσσας μέσα απο το CRM σας . Επισκεφθείτε το επίσημο Vtiger Marketpalce για να δείτε λεπτομέρειες.","tags":"Documentation","loc":"http://businesspi.github.io/leitourgiko-upiresies-logismiko.html","title":"Λειτουργικό Σύστημα, Υπηρεσίες παρασκηνίου και Λογισμικό"},{"text":"Banana Pi M1 Στο προϊγούμενο άρθρο κάναμε μια εισαγωγή στο τι είναι το BusinessPi το οποίο μπορείτε να διαβάσετε στην ανάρτηση : Τι είναι το BusinessPi Σήμερα θα κάνουμε μια παρουσίαση του Hardware δοκιμών που χρησιμοποιήθηκαν για την υλοποίηση του BusinessPi. Για τις ανάγκες του έργου έγινε εκτεταμένη έρευνα αγοράς για να επιλέξουμε τον ιδανικό συνδυασμό hardware και software ώστε να πληρούν τις εξής προϋποθέσεις : Ικανοποιητικές επιδόσεις για συνθήκες μιας μικρής επιχείρησης (έως 3-5 χρήστες) Συνδεσιμότητα και επεκτασιμότητα του hardware Βέλτιστο λόγο αξίας προς τιμή Αφού αποκλείσαμε κάποια μοντέλα (λόγοι κόστους/διαθεσιμότητας/επιδόσεων) επιλέξαμε και συγκρίναμε τα board που εμφανίζονται στον παρακάτω πίνακα. (Σημείωση η τιμή κόστους είναι ενδεικτική) Έτσι καταλήξαμε ότι η πρώτη έκδοση του έργου BusinessPi να γίνει διαθέσιμη για το Banana Pi M1 . Παρόλα αυτά η εγκατάσταση των λογισμικών που διαθέτει το BusinessPi μπορεί να γίνει αυτόματα με χρήση του ειδικού λογισμικού που αναπτύξαμε, ανεξάρτητα από το Board ή το λειτουργικό Linux που διαθέτει το Board σας. Η παρουσίαση του λογισμικού θα γίνει τις επόμενες μέρες. Συνοπτική περιγραφή του Banana Pi M1 Το Banana Pi M1 είναι ένας single-board υπολογιστής που κατασκευάζεται στην Κίνα. Χρησιμοποιεί την Allwinner Α20 SoC, διαθέτει διπύρηνο επεξεργαστή, 1GB RAM και η σύνδεση με το δίκτυο γίνεται διαμέσου της ενσωματωμένης ethernet. Το βασικό και επίσημο λειτουργικό σύστημα του BananaPi είναι το Bananian το οποίο είναι μια βελτιστοποιημένη έκδοση του λειτουργικού συστήματος Debian GNU/Linux για την πλατφόρμα του Banana Pi. Παρόλα αυτά όμως ο χρήστης μπορεί αν εγκαταστήσει και άλλες διανομές Linux. Ως λειτουργικά συστήματα υποστηρίζει : Android Ubuntu Debian OpenSUSE Fedora Μια εκτενείς λίστα διαθέσιμων λειτουργικών συστημάτων συμβατών με το Banana Pi M1 μπορείτε να δείτε εδώ http://www.banana-pi.org/download.html Τεχνικές προδιαγραφές Οι τεχνικές προδιαγραφές του Banana Pi M1 έχουν ως εξής: Οι θέσεις των προδιαγραφών που αναφέρονται στον παραπάνω πίνακα μπορούν να εντοπιστούν στο BananaPi στην παρακάτω εικόνα : Παρελκόμενα Επειδή τα board στην αγορά έρχονται ως έχουν (χωρίς δηλαδή περιφερικά), για τις ανάγκες του έργου χρησιμοποιήσαμε επίσης: μια SD Card Class 10 (για τις ανάγκες του OS/Software Stack) καλώδιο MicroUSB (για παροχή ρεύματος) καλώδιο δικτύου (για σύνδεση στο υφιστάμενο δίκτυο/internet) τα οποία φαίνονται στην παρακάτω εικόνα όπως είναι συνδεδεμένα και μπορείτε να διαβάσετε στην ανάρτηση : επί το έργον","tags":"Documentation","loc":"http://businesspi.github.io/hardware-dokimon.html","title":"Hardware δοκιμών"},{"text":"Καλωσήρθατε στο έργο BusinessPi Open data / opensourceway / CC BY-SA Το έργο BusinessPi αποτελεί συνδυασμό ανοικτού λογισμικού (μινιμαλιστικoύ LAMP stack και πλήρους VTiger CRM) και ανοικτού hardware (Pi-board), που συνδεόμενο στο τοπικό δίκτυο αυτοματοποιεί μια νέα εμπορική/υπηρεσιών η και εξαγωγική επιχείρηση (τηλέφωνα, ραντεβού, πωλήσεις, αποθήκη, υποστήριξη πελατών, γνωσιακή βάση κ.α.), με κόστος λιγότερο από 100 ευρώ (αγορά hardware). Τις επόμενες μέρες θα αναρτηθούν όλα όσα έχουν συνταχθεί με σκοπό να καταγράψουμε και να μεταδώσουμε γνώσεις σχετικά με: Τεχνικές προδιαγραφές Μεθοδολογίες Λογισμικά Hardware Εμπειρικά δεδομένα Τα παραπάνω καταγράφηκαν, συγκεντρώθηκαν και συντάχθηκαν πριν αλλά και κατά την διάρκεια ανάπτυξης του έργου BusinessPi προς όφελος την κοινότητας ΕΛ/ΛΑΚ με απώτερο σκοπό την Τυποποίηση των εργασιών που απαιτούνται για να μπορεί οποιοσδήποτε να αναπαράγει το έργο . Τις επόμενες μέρες θα αναρτήσω οδηγούς, αναφορές, τεχνικές πληροφορίες για το υλικό (Hardware) αλλά και το λογισμικό (software) το οποίο χρησιμοποιήθηκε για την ανάπτυξη του έργου BusinessPi Με την ανάγνωση των ενοτήτων, σκοπός είναι ο αναγνώστης να έχει μια πλήρη εικόνα των εργασιών και να μπορεί, εάν το επιθυμεί : Να δημιουργήσει το δικό του μικρό εταιρικό διακομιστή σε Pi Board Να μεταδώσει της γνώσεις στην κοινότητα ΕΛ/ΛΑΚ Να προτείνει νέες λύσεις Να συνδράμει στην βελτίωση και ανάπτυξη του έργου με την συμμετοχή του στην κοινότητα BusinessPi Καλούμε όσους ενδιαφέρονται να εμπλουτίσουν, να προτείνουν ή γενικά να συνδράμουν σε οποιοδήποτε τμήμα του έργου να επικοινωνήσουν μέσω του Support Puzzle pieces / ©opensource.com via Flickr / CC BY-SA Σκοπός της κοινότητας Σκοπός της κοινότητας BusinessPi είναι η προώθηση και ανάπτυξη: Ανοιχτών Προτύπων Ελεύθερου Λογισμικού Τεχνολογιών Ανοιχτής Αρχιτεκτονικής Διάδοση τεχνογνωσίας πληροφοριακών συστημάτων στο χώρο των επιχειρήσεων στην Ελλάδα, ενώ παράλληλα φιλοδοξεί να αποτελέσει κέντρο γνώσης και πλατφόρμα διαλόγου για επαγγελματίες IT που εργάζονται αλλά και χρησιμοποιούν ανοιχτές τεχνολογίες στον χώρο εργασίας τους. Με το έργο BusinessPi, προσπαθήσαμε να δημιουργήσουμε μια αρχική γνωσιακή βάση δεδομένων στην προσπάθειά μας να δώσουμε μια λύση συνδυασμού Hardware και Software, που αυτοματοποιεί μια νέα μικρή εμπορική/υπηρεσιών η και εξαγωγική επιχείρηση (τηλέφωνα, ραντεβού, πωλήσεις, αποθήκη, υποστήριξη πελατών, γνωσιακή βάση κ.α.), με κόστος λιγότερο από 100 ευρώ (για αγορά του hardware). Παράλληλα στόχος είναι να γίνουν παρουσιάσεις (βλέπε για νέα στην ιστοσελίδα http://businesspi.github.io/ ) του έργου σε εκδηλώσεις της κοινότητας ΕΛ/ΛΑΚ στην Ελλάδα και ταυτόχρονα να προσεγγίσουμε ομάδες που ασχολούνται με την επιχειρηματικότητα, τα stαrtups και την πληροφορική γενικότερα. Συνοψίζοντας, με το έργο BusinessPi ευελπιστούμε στην προσέλκυση ενδιαφερόμενων που θα συμμετέχουν στην κοινότητα BusinessPi για να: Διαδώσουμε το ΕΛ/ΛΑΚ στην επιχειρηματική κοινότητα Δημιουργήσουμε μια ενιαία αγορά υπηρεσιών ΕΛ/ΛΑΚ για ΜΜΕ Διευκολύνουμε τοπικούς επαγγελματίες της πληροφορικής να διαδώσουν το ΕΛ/ΛΑΚ, αποκομίζοντας ταυτόχρονα τα προς το ζην. Εμπλουτίσουμε την γνωσιακή βάση με τεκμηρίωση προερχόμενη από τις γνώσεις και εμπειρίες που αποκτήθηκαν κατά την υλοποίηση έργων ΕΛ/ΛΑΚ σε εταιρικά περιβάλλοντα. Όσοι ενδιαφέρονται παρακαλούμε όπως διαβάσουν τις οδηγίες στην σελίδα Support","tags":"Documentation","loc":"http://businesspi.github.io/ti-einai-to-businesspi.html","title":"Τι είναι το BusinessPi"},{"text":"Μιας και ολοκληρώθηκε η βασική δομή της ιστοσελίδας του BusinessPi θεώρησα ότι θα ήταν λογικό ανεβάσω μια εικόνα του BananaPi στο οποίο αναπτύσσεται το έργο. Επίσης να αναφέρω ότι ήδη έχει ξεκινήσει η σύνταξη της τεκμηρίωσης του όλου εγχειρήματος στο Wiki page . Υπάρχουν όμως πολλά ακόμα που έχουν να γίνουν σχετικά με το έργο αλλά και την καταγραφή της όλης προσπάθειας και είναι ήδη προγραμματισμένα να ανέβουν στην ιστοσελίδα, το wiki αλλά και το αποθετήριο.","tags":"Photos","loc":"http://businesspi.github.io/epi-to-ergon.html","title":"Επί το έργον"},{"text":"Αυτή είναι η επίσημη σελίδα του έργου BusinessPi.","tags":"News","loc":"http://businesspi.github.io/hello-world.html","title":"Hello World"}]}